{
  "general": [
    "You will find unexpected joy today.",
    "A pleasant surprise is waiting for you around the corner.",
    "Today is a good day to try something new.",
    "An exciting journey is about to begin for you.",
    "Your determination will open doors you never expected.",
    "A kind act today will bring you happiness tomorrow.",
    "Something you've been waiting for will finally arrive.",
    "Trust in the process; everything is falling into place.",
    "Your creativity will lead to an exciting opportunity.",
    "Happiness comes when you embrace the moment."
  ],
  "personalized": [
    "Dear {name}, a great opportunity is heading your way!",
    "{name}, your positive attitude will lead you to success.",
    "Good things are coming your way, {name}. Keep smiling!",
    "{name}, the choices you make today will shape a bright future.",
    "Stay confident, {name}. You are capable of amazing things!",
    "Unexpected joy is around the corner for you, {name}.",
    "{name}, the universe has big plans for you—get ready!",
    "Believe in yourself, {name}, and success will follow.",
    "You will receive good news soon, {name}—be patient!",
    "Your kindness and effort will not go unnoticed, {name}."
  ],
  "categories": {
    "love": [
      "Love is on the horizon. Embrace it with open arms.",
      "An old flame might reappear. Be open to rekindling connections.",
      "Romance will find you when you least expect it.",
      "Your heart will soon find the connection it's been seeking.",
      "A meaningful conversation will bring you closer to someone special.",
      "An unexpected act of love will brighten your day.",
      "A new relationship will bring fresh energy into your life.",
      "True love is built on trust—nurture your connections.",
      "The love you give will return to you in surprising ways.",
      "Open your heart to love, and love will find you."
    ],
    "career": [
      "Your hard work will soon pay off at work.",
      "A career opportunity is about to present itself.",
      "Be ready for a professional breakthrough.",
      "A new project will challenge and inspire you.",
      "Your leadership skills will be recognized in the workplace.",
      "Someone influential will take notice of your talents.",
      "Trust your instincts when making a big career decision.",
      "A small step today will lead to a big success tomorrow.",
      "The effort you put in now will yield great rewards.",
      "Stay focused—your professional dreams are within reach."
    ],
    "health": [
      "Take time to relax and care for your well-being.",
      "A healthy body leads to a healthy mind. Prioritize self-care.",
      "Small steps towards a healthier lifestyle will make a big difference.",
      "Listen to your body—it knows what it needs.",
      "Your energy levels will improve with better balance in life.",
      "Self-care is not selfish; it's necessary for success.",
      "A positive mindset will enhance your overall well-being.",
      "Today is a good day to start a new healthy habit.",
      "The more you prioritize yourself, the better you'll feel.",
      "Rest is just as important as action—find your balance."
    ]
  },
  "birthdays": {
    "January": [
      "A fresh start awaits you this January.",
      "January brings new beginnings and bright prospects.",
      "Your January birthday promises a year full of surprises.",
      "This year will bring clarity and purpose to your goals.",
      "Your birthday marks a time for reflection and bold new steps.",
      "Exciting opportunities will present themselves this year.",
      "You are about to experience a breakthrough moment.",
      "A birthday wish you make this year will come true.",
      "This year, you will meet someone who changes your perspective.",
      "Success and joy will follow you throughout the year."
    ],
    "February": [
      "Your February birthday is a sign of creativity and energy.",
      "Celebrate your birthday with warmth and joy this February.",
      "Love and laughter will fill your special February day.",
      "A new passion will emerge in your life this year.",
      "Your kindness will bring unexpected rewards this birthday.",
      "This year, your confidence will take you far.",
      "Your birthday marks the start of a new adventure.",
      "Your intuition will guide you to great opportunities.",
      "Cherish the love around you—this year will be special.",
      "Big surprises await you in the months ahead."
    ],
    "March": [
      "March into success with confidence on your birthday.",
      "Your birthday in March is a harbinger of good fortune.",
      "May your birthday in March be as vibrant as the spring.",
      "New friendships will enrich your life this year.",
      "This birthday marks a turning point towards happiness.",
      "Your resilience will lead to great achievements this year.",
      "A long-awaited dream will start to come true.",
      "Unexpected joy will enter your life soon.",
      "Your journey this year will be one of discovery.",
      "Embrace change—it will bring you amazing opportunities."
    ]
  },
  "personality": {
    "Anxious": [
      "Relax, take a deep breath—things will fall into place at the right time.",
      "Your overthinking will not change the outcome, but your confidence will.",
      "Trust the process—what worries you today will be a distant memory soon.",
      "You are stronger than your fears—believe in yourself.",
      "The unknown is not always bad—embrace the possibilities.",
      "A moment of calm will bring you clarity and peace.",
      "Take things one step at a time—there’s no rush.",
      "Your inner strength will guide you through uncertainty.",
      "Good things are coming—let go of the worry.",
      "You are more capable than you think—trust yourself."
    ],
    "Kind": [
      "Your kindness is a ripple that will come back to you tenfold.",
      "A small act of generosity today will bring you unexpected joy tomorrow.",
      "The world notices your goodness, even when it goes unspoken.",
      "Your warmth and compassion brighten the lives of others.",
      "Giving without expecting anything in return brings true joy.",
      "Someone will be inspired by your kindness today.",
      "A kind word from you will make a huge difference.",
      "Your generosity will open doors you never imagined.",
      "Compassion is your greatest strength—embrace it fully.",
      "The love you spread will always come back to you."
    ],
    "Rude": [
      "Your sharp words may cut, but they also build walls—choose wisely.",
      "A little patience and kindness will take you further than you think.",
      "The energy you give out is the energy you will receive—be mindful of it.",
      "Take a moment to listen before you react—you may learn something.",
      "A simple act of kindness can change your entire day.",
      "Your confidence is strong, but humility makes it stronger.",
      "Apologies are a sign of strength, not weakness.",
      "Patience will bring you more respect than aggression.",
      "A kind gesture will open a door that force never could.",
      "You have the power to lift others up—use it wisely."
    ]
  }
}
